# parameters
nc: 6  # number of classes
nkpt: 0 # number of keypoints
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

anchors:
  - [ 19,27,  44,40,  38,94 ]  # P3/8
  - [ 96,68,  86,152,  180,137 ]  # P4/16
  - [ 140,301,  303,264,  238,542 ]  # P5/32
  - [ 436,615,  739,380,  925,792 ]  # P6/64
# custom backbone

backbone:
  # [from, number, module, args]
  [ [ -1, 1, StemBlock, [32, 3, 2] ],    # 0-P2/4
    [ -1, 1, Shuffle_Block, [96, 2]], # 1-P3/8
    [ -1, 3, Shuffle_Block, [96, 1]], # 2
    [ -1, 1, Shuffle_Block, [192, 2]], # 3-P4/16
    [ -1, 7, Shuffle_Block, [192, 1]], # 4
    [ -1, 1, Shuffle_Block, [384, 2]], # 5-P5/32
    [ -1, 3, Shuffle_Block, [384, 1]], # 6
    [ -1, 1, SPPF, [384, 5]],
  ]

# v5lite-e head
head:
  [ [ -1, 1, Conv, [96, 1, 1]],
    [ -1, 1, nn.Upsample, [ None, 2, 'nearest']],
    [[ -1, 4], 1, Concat, [1]],  # cat backbone P4
    [ -1, 1, DWConvblock, [96, 3, 1]],  # 11

    [ -1, 1, Conv, [96, 1, 1]],
    [ -1, 1, nn.Upsample, [ None, 2, 'nearest']],
    [[ -1, 2], 1, Concat, [1]],  # cat backbone P3
    [ -1, 1, DWConvblock, [96, 3, 1] ],  # 15 (P3/8-small)

    [-1, 1, DWConvblock, [96, 3, 2]],
    [[ -1, 12], 1, ADD, [1]],  # cat head P4
    [ -1, 1, DWConvblock, [96, 3, 1]],  # 18 (P4/16-medium)

    [ -1, 1, DWConvblock, [96, 3, 2]],
    [[ -1, 8], 1, ADD, [1]],  # cat head P5
    [ -1, 1, DWConvblock, [96, 3, 1]],  # 21 (P5/32-large)

    [[ 15, 18, 21], 1, IKeypoint, [nc, anchors, nkpt]],  # Detect(P3, P4, P5)
  ]
